Autodesk.Revit.DB.TextNote.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,System.Double,System.String,Autodesk.Revit.DB.TextNoteOptions)
Creates a new line-wrapping text note element of the given width and properties.
Remarks:
As a view-specific element the text note will be visible only in the specified view.
The new text note will be created using the give text type, which defines the style.
The currently default style can be obtained from the Document.GetDefaultElementTypeId method.
document:
A valid Revit document that is currently modifiable (i.e. with an open transaction).
viewId:
Id of the graphic view in which the note is to be created.
position:
A model position of the new note.
Note that the position's relation to the text's bounding box depends on the requested text alignment
(set via the Options argument). It will be the box' top-left corner for a left-aligned text,
the top-right corner for a right-aligned text, and middle-top point if the text is to be centered.
width:
Width of the text in sheet units (i.e. as it is measured when printed.)
If a line of text is longer than the given specified Width, the text will be automatically wrapped.
text:
Text to populate the text note with.
options:
Options to control behavior and appearance of the text note.
Returns:
The newly created text note.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document is a family that cannot contain text notes.
-or-
The viewId does not represent a valid graphic view element in the given document.
-or-
The options structure does not contain a valid text type to use for a new text note in the given document.
-or-
A valid point must not be father then 10 miles (approx. 16 km) from the origin.
-or-
A valid width must have a positive value of less then 1000 feet (approx 300 m).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.TextNote.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,System.Double,System.String,Autodesk.Revit.DB.ElementId)
Creates a new line-wrapping text note element of the given width and properties.
Remarks:
As a view-specific element the text note will be visible only in the specified view.
The new text note will be created using the given text type, which defines the style.
The currently default style can be obtained from the Document.GetDefaultElementTypeId method.
document:
A valid Revit document that is currently modifiable (i.e. with an open transaction).
viewId:
Id of the graphic view in which the note is to be created.
position:
A model position of the new note.
For a left-aligned text (default), the origin is set at the top-left corner of the note's bounding box.
width:
Width of the text in sheet units (i.e. as it is measured when printed.)
If a line of text is longer than the specified Width, the text will be automatically wrapped.
text:
Text to populate the text note with.
typeId:
Id of the text type to use for the new text note.
Returns:
The newly created text note.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document is a family that cannot contain text notes.
-or-
The viewId does not represent a valid graphic view element in the given document.
-or-
The typeId does not represent a valid text type in the given document.
-or-
A valid point must not be father then 10 miles (approx. 16 km) from the origin.
-or-
A valid width must have a positive value of less then 1000 feet (approx 300 m).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.TextNote.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,System.String,Autodesk.Revit.DB.ElementId)
Creates a new unwrapped text note element with the given properties.
Remarks:
The new text note will consist of a single line of text unless there
are line-break characters (CR) in the given string. Once the text note is
created its width gets adjusted to fit the longest (or the single one) line of text.
As a view-specific element the text note will be visible only in the specified view.
The new text note will be created using the given text type, which defines the style.
The currently default style can be obtained from the Document.GetDefaultElementTypeId method.
document:
A valid Revit document that is currently modifiable (i.e. with an open transaction).
viewId:
Id of the graphic view in which the note is to be created.
position:
A model position of the new note.
For a left-aligned text (default), the origin is set at the top-left corner of the note's bounding box.
text:
Text to populate the text note with.
typeId:
Id of the text type to use for the new text note.
Returns:
The newly created text note.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document is a family that cannot contain text notes.
-or-
The viewId does not represent a valid graphic view element in the given document.
-or-
The typeId does not represent a valid text type in the given document.
-or-
A valid point must not be father then 10 miles (approx. 16 km) from the origin.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.TextNote.Leaders
Retrieves all leaders currently attached to the TextNote object.
Remarks: This property is ReadOnly.